Revit 2027 API
DocumentVersion.NumberOfSaves Property
 The number of times the document has been saved. The save number and GUID are both necessary to uniquely identify a document version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSaves { get; }
Public ReadOnly Property NumberOfSaves As Integer
	Get
public:
property int NumberOfSaves {
	int get ();
}
member NumberOfSaves : int with get
Property Value
Int32
See Also
Reference
DocumentVersion Class
Autodesk.Revit.DB Namespace